Create a table students with columns:

id (INT, primary key)

name (VARCHAR(50))

marks (INT)

class (VARCHAR(10))

Add a new column grade (VARCHAR(2)).

Rename column class â†’ section.

Delete the grade column.

Drop the students table completely.

In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@localhost/first

In [2]:
%%sql 

CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));

 * mysql+pymysql://root:***@localhost/first
(pymysql.err.OperationalError) (1050, "Table 'students' already exists")
[SQL: CREATE TABLE students (id INT PRIMARY KEY, name VARCHAR(50),marks INT,
                       class varchar(10));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
desc students; 
ALTER TABLE students ADD grade VARCHAR(2);

In [ ]:
%%sql
ALTER TABLE students
RENAME COLUMN class TO section;

In [6]:
%%sql
CREATE TABLE faculty (name VARCHAR(20));
RENAME TABLE teachers to faculty;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
(pymysql.err.OperationalError) (1050, "Table 'faculty' already exists")
[SQL: RENAME TABLE teachers to faculty;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%%sql
DROP TABLE faculty;
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.
3 rows affected.

[('employee',), ('employees',), ('students',)]

In [26]:

%%sql
INSERT INTO students (id, name, marks, section)
VALUES
(1, 'Aarav', 95, 'A'),
(2, 'Meera', 88, 'A'),
(3, 'Rohan', 76, 'B'),
(4, 'Priya', 64, 'B'),
(5, 'Karan', 82, 'C'),
(6, 'Isha', 91, 'C'),
(7, 'Vikram', 59, 'A'),
(8, 'Ananya', 85, 'B'),
(9, 'Sahil', 73, 'C'),
(10, 'Neha', 98, 'A');

 * mysql+pymysql://root:***@localhost/first
10 rows affected.

[]

Create a temporary table temp_high_marks that stores students with marks > 80.

Query the temporary table to show only name and marks.

Add a new student to the temporary table.

Drop the temporary table manually.

In [34]:
%%sql
CREATE TEMPORARY TABLE high_marks AS
SELECT name,section,marks
FROM students
WHERE marks>90;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[]

In [35]:
%%sql

SELECT * FROM  high_marks;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]

In [37]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('employee',), ('employees',), ('students',)]

| Can you do operations before WITH? | No |
| Must it end with a query using it? | Yes |
| Can the last query be only SELECT? | No, it can also be INSERT, UPDATE, DELETE |

In [42]:
%%sql
WITH high_scores AS(
SELECT * FROM high_marks
WHERE marks>=75)
SELECT * FROM high_scores;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[('Aarav', 'A', 95), ('Isha', 'C', 91), ('Neha', 'A', 98)]